БухЭксп/Enums/CW_ТипыПодключаемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыПодключаемыхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_РаботаСПодключаемымиОбъектамиСлужебный/Ext/Module.bsl
//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиков()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  
	
	//НачальноеЗаполнение
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РаботаСПодключаемымиОбъектамиСлужебный.ВыполнитьПодклчениеВстроенныхПечатныхФорм";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РаботаСПодключаемымиОбъектами";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 4;
	НоваяСтрока.Наименование		= "Выполнить подключение встроенных печатных форм";
	НоваяСтрока.Комментарий			= "Выполняет подключение встронных печатных форм документов";
	//---НачальноеЗаполнение
	
	
	//ПриКаждомОбновлении
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РаботаСПодключаемымиОбъектамиСлужебный.ОбновитьСписокИдентифкаторовПодклчюаемыхОбъектов";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РаботаСПодключаемымиОбъектами";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 4;
	НоваяСтрока.Наименование		= "Обновить список идентификаторов подклчюаемых объектов";
	НоваяСтрока.Комментарий			= "Обновляет список идентификаторов подключаемых объетов";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РаботаСПодключаемымиОбъектамиСлужебный.ПроверитьАктуальностьВстроенныхОбработок";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РаботаСПодключаемымиОбъектами";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 4;
	НоваяСтрока.Наименование		= "Проверить актуальность встроенных обработок";
	НоваяСтрока.Комментарий			= "Актуализирует список встроенных внешних отчетов и обработок";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РаботаСПодключаемымиОбъектамиСлужебный.ОбновитьСведенияОПодключаемыхОбъектах";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РаботаСПодключаемымиОбъектами";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 4;
	НоваяСтрока.Наименование		= "Обновить сведения о подключаемых объектах";
	НоваяСтрока.Комментарий			= "Актуализирует инфорацию встроенных внешних отчетов и обработок";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РаботаСПодключаемымиОбъектамиСлужебный.ОбновитьПредставлениеВидаОбработки";  
	НоваяСтрока.Версия 				= "3.2.1.2";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РаботаСПодключаемымиОбъектами";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 4;
	НоваяСтрока.Наименование		= "Обновить представление вида обработки";
	НоваяСтрока.Комментарий			= "Обновляет представление вида обработки";   
	//ПриКаждомОбновлении
	
	////Версия 8.3.0.0
	//НоваяСтрока = Обработчики.Добавить();
	//НоваяСтрока.ИмяОбработчика  		= "CW_РаботаСПодключаемымиОбъектамиСлужебный.<...>";  
	//НоваяСтрока.Версия 				= "8.3.0.0";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_РаботаСПодключаемымиОбъектами";
	//НоваяСтрока.НачальноеЗаполнение	= Ложь;
	//НоваяСтрока.ПриКаждомОбновлении	= Истина;
	//НоваяСтрока.РежимВыполнения		= "Оперативно";
	//НоваяСтрока.ОчередьВыполнения		= 9;
	//НоваяСтрока.Наименование			= "<>";
	//НоваяСтрока.Комментарий			= "<>";   
	////Версия 8.3.0.0

КонецПроцедуры   



//Процедуры первого запуска конфигурации   
Процедура ВыполнитьПодклчениеВстроенныхПечатныхФорм(АдресРезультата=Неопределено) Экспорт
	
	МассивПФДляПроверки = Новый Массив;
	МассивПФДляПроверки.Добавить("CW_ПФ_СчетДоходы");
	МассивПФДляПроверки.Добавить("CW_ПФ_АктДоходы");
	МассивПФДляПроверки.Добавить("CW_ПФ_СФДоходы");
	МассивПФДляПроверки.Добавить("CW_ПФ_ОтчетЭкспедитора");
	МассивПФДляПроверки.Добавить("CW_ПФ_Док_ОтчетЭкспедитора");
	МассивПФДляПроверки.Добавить("CW_ПФ_АктРасходы");
	МассивПФДляПроверки.Добавить("CW_ПФ_СчетРасходы");
	МассивПФДляПроверки.Добавить("CW_ПФ_ПутевойЛист4П");
	МассивПФДляПроверки.Добавить("CW_ПФ_ПутевойЛист4С");
	
	ПодключитьВстроенныеПечатныеФормыИОбъекты(МассивПФДляПроверки);   
	
КонецПроцедуры

Процедура ПодключитьВстроенныеПечатныеФормыИОбъекты(МассивПодключаемыхОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка,
	|	CW_ПодключаемыеОбъекты.ИмяВстроеннойОбработки КАК ИмяВстроеннойОбработки
	|ИЗ
	|	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	|ГДЕ
	|	CW_ПодключаемыеОбъекты.Встроенная
	|	И НЕ CW_ПодключаемыеОбъекты.ПометкаУдаления
	|	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Индекс = МассивПодключаемыхОбъектов.Найти(Выборка.ИмяВстроеннойОбработки);
		Если Индекс <> Неопределено Тогда
			МассивПодключаемыхОбъектов.Удалить(Индекс);
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого ИмяОбработки Из МассивПодключаемыхОбъектов Цикл
		
		ПФОбъект = Справочники.CW_ПодключаемыеОбъекты.СоздатьЭлемент();
		ПФОбъект.Встроенная 			= Истина;
		ПФОбъект.ИмяВстроеннойОбработки = ИмяОбработки;
		ПФОбъект.ДополнительныеСвойства.Вставить("ВыполнитьРегистрацию", истина);
		ПФОбъект.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры
//Процедуры первого запуска конфигурации   

//Обязательные процедуры при переходе на каждый релиз
Процедура ВыполнитьПовторноеПодклчюениеВстроенныхОбработокИОтчетов(АдресРезультата=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка,
	               |	CW_ПодключаемыеОбъекты.Встроенная КАК Встроенная
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СобытияДляЖурналаРегистрации = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		ОбработкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
	
		Попытка
			
			Если Выборка.Встроенная Тогда
				
				//нужно просто перезаписать с ключем "ВыполнитьРегистрацию" 
				ОбработкаОбъект.ДополнительныеСвойства.Вставить("ВыполнитьРегистрацию" , Истина);
				ОбработкаОбъект.ДополнительныеСвойства.Вставить("НеПоказыватьСообщения", Истина);
				ОбработкаОбъект.Записать();
				
			Иначе
				
				ОбработкаОбъект.ДополнительныеСвойства.Вставить("НеПоказыватьСообщения", Истина);
				ОбработкаОбъект.Записать();
				
			КонецЕсли;
			
			Если ОбработкаОбъект.Вид = "ВнешняяКоманда" Тогда
				//Обновим регистрацию
				Справочники.CW_ПодключаемыеОбъекты.ЗарегистрироватьВнешниеКоманды(ОбработкаОбъект.Ссылка);
			КонецЕсли;
			
		Исключение
			
			ОбработкаОбъект.ДополнительныеСвойства.Вставить("ВыполнитьРегистрацию"	, Ложь);
			ОбработкаОбъект.ДополнительныеСвойства.Вставить("НеПоказыватьСообщения"	, Истина);
			ОбработкаОбъект.НеИспользуется = Истина;
			ОбработкаОбъект.Записать();
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСписокИдентифкаторовПодклчюаемыхОбъектов(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ИдентификаторыПодключаемыхОбъектов.ОбновитьСписокПодключаемыхОтчетовОбработок();
	
КонецПроцедуры

Процедура ПроверитьАктуальностьВстроенныхОбработок(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ПодключаемыеОбъекты.ПроверитьАктуальностьВстроенныхОбработок();
	
КонецПроцедуры

Процедура ОбновитьСведенияОПодключаемыхОбъектах(АдресРезультата=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПодключаемыеОбъекты.ТипВнешнегоОбъекта = Значение(Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка)
	               |	И CW_ПодключаемыеОбъекты.Вид = &Вид
	               |	И CW_ПодключаемыеОбъекты.Встроенная = ИСТИНА";
	
	ВидОбъекта = CW_ПодключаемыеКомандыСервер.ВидОбработкиПечатнаяФорма();
	Запрос.УстановитьПараметр("Вид", ВидОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Обработка 		  = _ПО.ПолучитьОбработку(Выборка.Ссылка);
			СтруктураОписания = Обработка.Информация();
		Исключение
			Продолжить;
		КонецПопытки;
		
		ТОбъект	= Выборка.Ссылка.ПолучитьОбъект();
		_ПО.ЗаполнитьИнформациюПоОбработке(ТОбъект,СтруктураОписания);
		
		ТОбъект.ОбменДанными.Загрузка = Истина;
		ТОбъект.Записать();

	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПредставлениеВидаОбработки(АдресРезультата=Неопределено) Экспорт

	Справочники.CW_ПодключаемыеОбъекты.ОбновитьПредставлениеВидаОбработки();
	
КонецПроцедуры//Обязательные процедуры при переходе на каждый релиз
